## Reto 2: Manipulación de Strings

### 1. Objetivos:
    - Practicar manipular `strings` usando métodos como `split`, `title`, `strip, etc.
 
---
    
### 2. Desarrollo:

#### Limpiando strings usando la propiedad `str`

Vamos a trabajar en la versión del dataset que guardaste en el reto pasado. Las acciones que tienes que tomar en este Reto son las siguientes:

1. Reemplaza los guiones en las `strings` de la columna `orbit_class_description` por espacios.
2. Elimina los espacios vacíos al principio y final de las `strings` de la misma columna.
3. Hay una columna llamada `id_name` que contiene el 'id' y el nombre de cada objeto separados por un guión. Separa estos datos en dos columnas llamadas `id` y `name`.
4. Haz que las `strings` de la columna `orbiting_body` empiecen con mayúscula.
5. Asigna el `DataFrame` resultante a la variable `df_reto_2`.
6. Guarda tu resultado en un archivo .csv.

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd

In [10]:
df_reto_2 = pd.read_csv('/content/drive/MyDrive/reto1.csv')

df_reto_2.head()

   Unnamed: 0  ...                            orbit_class_description
0           0  ...    Near-Earth-asteroid-orbits-similar-to-that-o...
1           1  ...    Near-Earth-asteroid-orbits-which-cross-the-E...
2           3  ...    Near-Earth-asteroid-orbits-similar-to-that-o...
3           4  ...   Near-Earth-asteroid-orbits-similar-to-that-of...
4           5  ...   An-asteroid-orbit-contained-entirely-within-t...

[5 rows x 12 columns]

In [11]:
df_reto_2['orbit_class_description'] = df_reto_2['orbit_class_description'].str.replace('-', ' ')

df_reto_2['orbit_class_description']

0        Near Earth asteroid orbits similar to that o...
1        Near Earth asteroid orbits which cross the E...
2        Near Earth asteroid orbits similar to that o...
3       Near Earth asteroid orbits similar to that of...
4       An asteroid orbit contained entirely within t...
                             ...
296     Near Earth asteroid orbits similar to that of...
297      Near Earth asteroid orbits similar to that o...
298      Near Earth asteroid orbits which cross the E...
299     An asteroid orbit contained entirely within t...
300      Near Earth asteroid orbits similar to that o...
Name: orbit_class_description, Length: 301, dtype: object

In [13]:
df_reto_2['orbit_class_description'] = df_reto_2['orbit_class_description'].str.strip()

df_reto_2.loc[0, 'orbit_class_description']

'Near Earth asteroid orbits similar to that of 2062 Aten'

In [14]:
df_reto_2[['id', 'name']] = df_reto_2['id_name'].str.split('-', expand=True)

df_reto_2.head()

   Unnamed: 0  Unnamed: 0.1  ...       id                name
0           0             0  ...  2154652  154652 (2004 EP20)
1           1             1  ...  3153509           (2003 HM)
2           3             3  ...  3837644          (2019 AY3)
3           4             4  ...  3843493           (2019 PY)
4           5             5  ...  3765015         (2016 WR48)

[5 rows x 14 columns]

In [17]:
df_reto_2['orbiting_body'] = df_reto_2['orbiting_body'].str.title()

df_reto_2['orbiting_body']

0      Earth
1      Earth
2      Earth
3      Earth
4      Earth
       ...
296    Earth
297    Earth
298    Earth
299    Earth
300    Earth
Name: orbiting_body, Length: 301, dtype: object

In [18]:
df_reto_2.to_csv('/content/drive/MyDrive/reto2.csv')

¡Compara con tus compañeros y con la experta tu solución para asegurarte de que realizaste los procesos adecuadamente!